
export const headerGetDesc = (catalog) => {

  switch (catalog) {
    case '11900213':
      return "Всевозможные провода для синхронизации, передачи данных, фото и видео, от тайпс(type-c) до лайтинга(lightning) с телефона и компьютера"
    case '11900214':
      return "Купить чехол для смартфона, телефона или планшета на любой вкус, водонепроницаемые, с защитой от пыли, качественные и при этом не дорогие"
    case '11900215':
      return "Тут можно купить защитное стекло практически для любого телефона или смартфона, быстро, качественно и главное не дорого"
    case '11900217':
      return "Зарядки для любого телефона или планшета - micro-usb, type-c, lightning и т.д."
    case '11900220':
      return "Ты на верном пути странник! Селфи палки здесь и сейчас, недорого, но качественно, криворукость больше не испортит фото в инстаграм!"
    case '11900221':
      return "Автодержатель для смартфона и планшета! В автомобиле или на велосипеде, забудьте о разбитом экране, легко принимайте звонки, и двигайтесь по навигатору."
    case '11900222':
      return "Переходники с lightning на 3.5мм для подключения проводных наушников. Переходники между type-c, micro-usb, lightning и многих других"
    case '11900223':
      return "Ругается google play? Не хватает места для сериала? Уже даже смс не примимает? Просто докупите память на смартфон или планшет!"
    case '11900228':
      return "Надулся аккумулятор/батарея смартфона или планшета? Может и вовсе сдохла? Не рискуйте, закажите у нас новую!"
    case '11900211':
      return "Беспроводная гарнитура, наушники — для смартфона и пк, для iphone, android, и windows. Для меломанов и простых обывателей!"
    case '11900212':
      return "Заканчивается заряд в самый ответственный момент?!(просмотр фильма в маршрутке) Не беда, купите дополнительное хранилище энергии, павербанк!"
    case '11900216':
      return "Беспроводные колонки для всей семьи! Обрадуйте соседей и прохожих своим чудесным музыкальным вкусом!"
    case '11900219':
      return "Забудьте о бесячих проводах времен мезозоя! Заряжайте телефон просто положив на доску! Никаких расшатанных гнезд, спутанных или утерянных проводов!"
    case '11900233':
      return "Берегите свои беспроводные технологии! Не теряйте и не пачкайте наушники, будет обидно поцарапать новенькие airpods!"
    case '11900218':
      return "Выбросьте свои прикуриватели, курить вредно! Лучше замените их на удобную зарядку для телефона, долгая дорога теперь не помеха!"
    case '11900224':
      return "Забудьте о дорогих широкоформатных телевизорах! С VR очками смотрите фильмы, играйте с максимальным углом обзора даже в пути!"
    case '11900226':
      return "Не хватает длины провода для ноута, телефона или телевизора? Вам нужен высокотехнологичный удлинитель, как раз у нас такие есть!"
    case '11900231':
      return "Лучшие ремешки для смарт и обычных часов, всех формфакторов и размеров, дешёвые и очень дешёвые!"
    case '11900232':
      return "Джойстики для игр на пк и телефоне, контролеры для смартфона — сделайте всех в PUBG или майнкрафт одним мизинцем!"
    case '11900234':
      return "Поддерживайте комфортный уровень влажности воздуха в квартире. Это важно!"
    case '11900235':
      return "Вы во мраке?! Мы наполним вашу жизнь светом! Светильники для тик-тока или бумажной работы, покупайте, не пожалеете!"
  }
}