export const headerGetDesc = (catalog, loc) => {

  const locale = loc.locale;

  if (locale === "ru") {
    switch (catalog) {
      case '11900213':
        return "Всевозможные провода для синхронизации, передачи данных, фото и видео, от тайпс(type-c) до лайтинга(lightning) с телефона и компьютера"
      case '11900214':
        return "Купить чехол для смартфона, телефона или планшета на любой вкус, водонепроницаемые, с защитой от пыли, качественные и при этом не дорогие"
      case '11900215':
        return "Тут можно купить защитное стекло практически для любого телефона или смартфона, быстро, качественно и главное не дорого"
      case '11900217':
        return "Зарядки для любого телефона или планшета - micro-usb, type-c, lightning и т.д."
      case '11900220':
        return "Ты на верном пути странник! Селфи палки здесь и сейчас, недорого, но качественно, криворукость больше не испортит фото в инстаграм!"
      case '11900221':
        return "Автодержатель для смартфона и планшета! В автомобиле или на велосипеде, забудьте о разбитом экране, легко принимайте звонки, и двигайтесь по навигатору."
      case '11900222':
        return "Переходники с lightning на 3.5мм для подключения проводных наушников. Переходники между type-c, micro-usb, lightning и многих других"
      case '11900223':
        return "Ругается google play? Не хватает места для сериала? Уже даже смс не примимает? Просто докупите память на смартфон или планшет!"
      case '11900228':
        return "Надулся аккумулятор/батарея смартфона или планшета? Может и вовсе сдохла? Не рискуйте, закажите у нас новую!"
      case '11900211':
        return "Беспроводная гарнитура, наушники — для смартфона и пк, для iphone, android, и windows. Для меломанов и простых обывателей!"
      case '11900212':
        return "Заканчивается заряд в самый ответственный момент?!(просмотр фильма в маршрутке) Не беда, купите дополнительное хранилище энергии, павербанк!"
      case '11900216':
        return "Беспроводные колонки для всей семьи! Обрадуйте соседей и прохожих своим чудесным музыкальным вкусом!"
      case '11900219':
        return "Забудьте о бесячих проводах времен мезозоя! Заряжайте телефон просто положив на доску! Никаких расшатанных гнезд, спутанных или утерянных проводов!"
      case '11900233':
        return "Берегите свои беспроводные технологии! Не теряйте и не пачкайте наушники, будет обидно поцарапать новенькие airpods!"
      case '11900218':
        return "Выбросьте свои прикуриватели, курить вредно! Лучше замените их на удобную зарядку для телефона, долгая дорога теперь не помеха!"
      case '11900224':
        return "Забудьте о дорогих широкоформатных телевизорах! С VR очками смотрите фильмы, играйте с максимальным углом обзора даже в пути!"
      case '11900226':
        return "Не хватает длины провода для ноута, телефона или телевизора? Вам нужен высокотехнологичный удлинитель, как раз у нас такие есть!"
      case '11900231':
        return "Лучшие ремешки для смарт и обычных часов, всех форм факторов и размеров, дешёвые и очень дешёвые!"
      case '11900232':
        return "Джойстики для игр на пк и телефоне, контролеры для смартфона — сделайте всех в PUBG или майнкрафт одним мизинцем!"
      case '11900234':
        return "Поддерживайте комфортный уровень влажности воздуха в квартире. Это важно!"
      case '11900235':
        return "Вы во мраке?! Мы наполним вашу жизнь светом! Светильники для тик-тока или бумажной работы, покупайте, не пожалеете!"
    }
  } else {
    switch (catalog) {
      case '11900213':
        return "Всілякі дроти для синхронізації, передачі даних, фото і відео, від тайпс (type-c) до лайтинг (lightning) з телефону і комп'ютера"
      case '11900214':
        return "Купити чохол для смартфона, телефону або планшета на будь-який смак, водонепроникні, із захистом від пилу, якісні і при цьому не дорогі"
      case '11900215':
        return "Тут можна купити захисне скло практично для будь-якого телефону або смартфону, швидко, якісно і головне не дорого"
      case '11900217':
        return "Зарядки для будь-якого телефону або планшета - micro-usb, type-c, lightning і т.д."
      case '11900220':
        return "Ти на вірному шляху мандрівник! Селфі палиці тут і зараз, недорого, але якісно, криворукість більше не зіпсує фото в інстаграм!"
      case '11900221':
        return "Автодержатель для смартфона і планшета! В автомобілі або на велосипеді, забудьте про розбитому екрані, легко приймайте дзвінки, і рухайтеся по навігатору."
      case '11900222':
        return "Перехідники з lightning на 3.5мм для підключення дротових навушників. Перехідники між type-c, micro-usb, lightning і багатьох інших"
      case '11900223':
        return "Лається google play? Бракує місця для серіалу? Уже навіть смс НЕ прімімает? Просто докупити пам'ять на смартфон або планшет!"
      case '11900228':
        return "Надувся акумулятор/батарея смартфона або планшета? Може і зовсім здохла? Не ризикуйте, замовте у нас нову!"
      case '11900211':
        return "Бездротова гарнітура, навушники - для смартфона і пк, для iphone, android, і windows. Для меломанів і простих обивателів!"
      case '11900212':
        return "Закінчується заряд в найвідповідальніший момент?! (Перегляд фільму в маршрутці) Не біда, купіть додаткове сховище енергії, павербанк!"
      case '11900216':
        return "Бездротові колонки для всієї родини! Ощасливте сусідів і перехожих своїм чудовим музичним смаком!"
      case '11900219':
        return "Забудьте про бісячі кабеля часів мезозою! Заряджайте телефон просто поклавши на дошку! Ніяких розхитаних гнізд, поплутаних або загублених проводів!"
      case '11900233':
        return "Бережіть свої бездротові технології! Не втрачайте і не брудніть навушники, буде прикро подряпати новенькі airpods!"
      case '11900218':
        return "Викиньте свої прикурювачі, курити шкідливо! Краще замініть їх на зручну зарядку для телефону, довга дорога тепер не перешкода!"
      case '11900224':
        return "Забудьте про дорогі широкоформатні телевізори! З VR окулярами дивіться фільми, грайте з максимальним кутом огляду навіть в дорозі!"
      case '11900226':
        return "Бракує довжини кабеля для ноута, телефона або телевізора? Вам потрібен високотехнологічний подовжувач, який збіг, саме такі у нас і є!"
      case '11900231':
        return "Найкращі ремінці для смарт(і не зовсім) годинників, всіх форм факторів і розмірів, є дешеві а також дуже дешеві!"
      case '11900232':
        return "Джойстики для ігор на пк і телефоні, контролери для смартфона - зробіть всіх в PUBG або майнкрафт одним мізинцем!"
      case '11900234':
        return "Підтримуйте комфортний рівень вологості повітря в квартирі. Це важливо!"
      case '11900235':
        return "Ви в темряві ?! Ми наповнимо ваше життя світлом! Світильники для Тік-Току або паперової роботи, купуйте, не пошкодуєте!"
    }
  }
}