import React from "react";
import ss from "../info.module.css";
import s from "./licagr.module.css"
import {useRouter} from "next/router";

export const Licagr = () => {

  const locale = useRouter().locale;

  if(locale === "ru"){
    return (
      <div className={ss.infoMain+' '+s.licagrMain}>
        <h1>Условия использования сайта</h1>
        <p><strong>Внимание! Перед просмотром этого сайта внимательно прочитайте данные условия. Если вы не согласны
          с этими условиями, не используйте этот сайт. При использовании этого сайта вы автоматически соглашаетесь с условиями.</strong></p>

        <h2>Использование сайта</h2>
        <p>Сайт vsivuha разрешает вам просматривать и загружать материалы этого сайта (далее – «Сайт») только для
          личного некоммерческого использования, при условии сохранения вами всей информации об авторском праве и
          других сведений о праве собственности, содержащихся в исходных материалах и любых их копиях. Запрещается
          изменять материалы этого Сайта, а также распространять или демонстрировать их в любом виде или
          использовать их любым другим образом для общественных или коммерческих целей. Любое использование этих
          материалов на других сайтах или в компьютерных сетях запрещается.</p>

        <h2>Oтказ от ответственности</h2>
        <p>Материалы и услуги этого сайта предоставляются «как есть» без каких-либо гарантий. Vsivuha не гарантирует
          точности и полноты материалов, программ и услуг, предоставляемых на этом Сайте. Vsivuha в любое время
          без уведомления может вносить изменения в материалы и услуги, предоставляемые на этом Сайте, а также в
          упомянутые в них продукты и цены. В случае устаревания материалов и услуг на этом Сайте Vsivuha не
          обязуется обновлять их. Vsivuha ни при каких обстоятельствах не несет ответственности за любой ущерб
          (включая, но не ограничиваясь ущербом от потери прибыли, данных или от прерывания деловой активности),
          возникший вследствие использования, невозможности использования или результатов использования этого
          сайта.</p>

        <h2>Регистрация на сайте</h2>
        <p>Регистрируясь на Сайте, вы соглашаетесь предоставить достоверную и точную информацию о себе и своих
          контактных данных.</p>

        <p>В результате регистрации вы получаете логин и пароль, за безопасность которых вы несете ответственность.
          Вы также несете ответственность за все действия под вашим логином и паролем на Сайте. В случае утери
          регистрационных данных вы обязуетесь сообщить нам об этом.</p>

        <h2>Обратная связь и комментарии</h2>
        <p>Обращаясь к нам или оставляя комментарии на сайте, вы несете ответственность, что данное сообщение не
          является незаконным, вредоносным, угрожающим, клеветническим, оскорбляет нравственность, нарушает
          авторские права, пропагандирует ненависть и/или дискриминацию людей по расовому, этническому, половому,
          религиозному, социальному признакам, содержит оскорбления в адрес конкретных лиц или организаций, а
          также каким-либо иным образом нарушает действующее законодательство Украины. Вы соглашаетесь, что любое
          ваше сообщение Vsivuha может удалять без вашего на то согласия, а также безвозмездно использовать по
          своему усмотрению. Vsivuha не несет ответственности за любую информацию, размещенную пользователями
          Сайта.</p>

        <h2>Использование персональных данных</h2>
        <p>Мы используем различные технологии для сбора и хранения информации, когда вы посещаете сайт Vsivuha
          (подробнее о защите и обработке персональных данных ). Это может включать в себя запись одного или
          нескольких куки или анонимных идентификаторов. Мы также используем куки и анонимные идентификаторы,
          когда вы взаимодействуете с услугами, предложенными нашими партнерами, такими как рекламные услуги,
          например, которые могут появиться на других сайтах.</p>

        <p>Мы можем передавать информацию указанную пользователями сайта третьим лицам для осуществления доставки
          товара пользователям.</p>

        <h2>Сообщения и рассылки</h2>
        <p>Vsivuha может направлять вам сообщение в ответ на сообщения (запросы и жалобы), направленные вами через
          форму обратной связи и в процессе заказа товаров и/или услуг, при управлении заказами, востановлении
          пароля, выдачи товаров, оказании услуг. Vsivuha осуществляет передачу сообщений в виде email-писем,
          сообщений в Viber/Telegram, SMS-сообщений, уведомлений в мобильном приложении, уведомлений в веб-браузере.</p>
      </div>
    )
  }else {
    return (
      <div className={ss.infoMain+' '+s.licagrMain}>
        <h1>Умови використання сайту</h1>
        <p><strong>Увага! Перед переглядом цього сайту уважно прочитайте ці умови. Якщо ви не згодні
          з цими умовами, не використовуйте цей сайт. При використанні цього сайту ви автоматично погоджуєтеся з умовами.</strong></p>

        <h2>Використання сайту</h2>
        <p>Сайт vsivuha дозволяє вам переглядати і завантажувати матеріали цього сайту (далі - «Сайт») тільки для
          особистого некомерційного використання, за умови збереження вами всієї інформації про авторське право і
          інших відомостей про право власності, що містяться у вихідних матеріалах і будь-яких їхніх копіях. Забороняється
          змінювати матеріали цього Сайту, а також поширювати або демонструвати їх в будь-якому вигляді або
          використовувати їх будь-яким іншим чином для суспільних або комерційних цілей. Будь-яке використання цих
          матеріалів на інших сайтах або в комп'ютерних мережах забороняється.</p>

        <h2>Відмова від відповідальності</h2>
        <p>Матеріали і послуги цього сайту надаються «як є» без будь-яких гарантій. Vsivuha не гарантує
          точності і повноти матеріалів, програм і послуг, що надаються на цьому Сайті. Vsivuha в будь-який час
          без повідомлення може вносити зміни в матеріали і послуги, що надаються на цьому Сайті, а також в
          згадані в них продукти і ціни. У разі старіння матеріалів і послуг на цьому Сайті Vsivuha НЕ
          зобов'язується оновлювати їх. Vsivuha ні за яких обставин не несе відповідальності за будь-які збитки
          (Включаючи, але не обмежуючись збитком від втрати прибутку, даних або від переривання ділової активності),
          виник внаслідок використання, неможливості використання або результатів використання цього
          сайту.</p>

        <h2>Реєстрація на сайті</h2>
        <p>Реєструючись на Сайті, ви погоджуєтеся надати достовірну і точну інформацію про себе і своїх
          контактних даних.</p>

        <p>В результаті реєстрації ви отримуєте логін і пароль, за безпеку яких ви несете відповідальність.
          Ви також несете відповідальність за всі дії під вашим логіном і паролем на Сайті. У разі втрати
          реєстраційних даних ви зобов'язуєтеся повідомити нам про це.</p>

        <h2>Зворотній зв'язок і коментарі</h2>
        <p>Звертаючись до нас або залишаючи коментарі на сайті, ви несете відповідальність, що це повідомлення не
          є незаконним, шкідливим, загрозливим, наклепницьким, ображає моральність, порушує
          авторські права, пропагує ненависть і/або дискримінацію людей за расовою, етнічною, статевою,
          релігійною, соціальною ознаками, містить образи на адресу конкретних осіб або організацій, а
          також будь-яким іншим чином порушує чинне законодавство України. Ви погоджуєтеся, що будь-який
          ваше повідомлення Vsivuha може видаляти без вашого на те згоди, а також безоплатно використовувати на
          свій розсуд. Vsivuha не несе відповідальності за будь-яку інформацію, розміщену користувачами
          Сайту.</p>

        <h2>Використання персональних даних</h2>
        <p>Ми використовуємо різні технології для збору і зберігання інформації, коли ви відвідуєте сайт Vsivuha.
          Це може включати в себе запис одного або
          декількох куки або анонімних ідентифікаторів. Ми також використовуємо куки і анонімні ідентифікатори,
          коли ви взаємодієте з послугами, запропонованими нашими партнерами, такими як рекламні послуги, які можуть з'явитися на інших сайтах.</p>

        <p>Ми можемо передавати інформацію зазначену користувачами сайту третім особам для здійснення доставки
          товару користувачам.</p>

        <h2>Повідомлення і розсилки</h2>
        <p>Vsivuha може направляти вам повідомлення у відповідь на повідомлення (запити і скарги), спрямовані вами через
          форму зворотного зв'язку і в процесі замовлення товарів і/або послуг, при управлінні замовленнями, відновленні
          пароля, видачі товарів, надання послуг. Vsivuha здійснює передачу повідомлень у вигляді email-листів,
          повідомлень в Viber/Telegram, SMS-повідомлень, повідомлень в мобільному додатку, повідомлень в веб-браузері.</p>
      </div>
    )
  }


}