import React from "react";
import ss from "../info.module.css";
import s from "./licagr.module.css"

export const Licagr = () => {

    return (
        <div className={ss.infoMain+' '+s.licagrMain}>
            <h1>Условия использования сайта</h1>
            <p><strong>Внимание! Перед просмотром этого сайта внимательно прочитайте данные условия. Если вы не согласны
                с этими условиями, не используйте этот сайт. При использовании этого сайта вы автоматически соглашаетесь с условиями.</strong></p>

            <h2>Использование сайта</h2>
            <p>Сайт vsivuha разрешает вам просматривать и загружать материалы этого сайта (далее – «Сайт») только для
                личного некоммерческого использования, при условии сохранения вами всей информации об авторском праве и
                других сведений о праве собственности, содержащихся в исходных материалах и любых их копиях. Запрещается
                изменять материалы этого Сайта, а также распространять или демонстрировать их в любом виде или
                использовать их любым другим образом для общественных или коммерческих целей. Любое использование этих
                материалов на других сайтах или в компьютерных сетях запрещается.</p>

            <h2>Oтказ от ответственности</h2>
            <p>Материалы и услуги этого сайта предоставляются «как есть» без каких-либо гарантий. Vsivuha не гарантирует
                точности и полноты материалов, программ и услуг, предоставляемых на этом Сайте. Vsivuha в любое время
                без уведомления может вносить изменения в материалы и услуги, предоставляемые на этом Сайте, а также в
                упомянутые в них продукты и цены. В случае устаревания материалов и услуг на этом Сайте Vsivuha не
                обязуется обновлять их. Vsivuha ни при каких обстоятельствах не несет ответственности за любой ущерб
                (включая, но не ограничиваясь ущербом от потери прибыли, данных или от прерывания деловой активности),
                возникший вследствие использования, невозможности использования или результатов использования этого
                сайта.</p>

            <h2>Регистрация на сайте</h2>
            <p>Регистрируясь на Сайте, вы соглашаетесь предоставить достоверную и точную информацию о себе и своих
                контактных данных.</p>

            <p>В результате регистрации вы получаете логин и пароль, за безопасность которых вы несете ответственность.
                Вы также несете ответственность за все действия под вашим логином и паролем на Сайте. В случае утери
                регистрационных данных вы обязуетесь сообщить нам об этом.</p>

            <h2>Обратная связь и комментарии</h2>
            <p>Обращаясь к нам или оставляя комментарии на сайте, вы несете ответственность, что данное сообщение не
                является незаконным, вредоносным, угрожающим, клеветническим, оскорбляет нравственность, нарушает
                авторские права, пропагандирует ненависть и/или дискриминацию людей по расовому, этническому, половому,
                религиозному, социальному признакам, содержит оскорбления в адрес конкретных лиц или организаций, а
                также каким-либо иным образом нарушает действующее законодательство Украины. Вы соглашаетесь, что любое
                ваше сообщение Vsivuha может удалять без вашего на то согласия, а также безвозмездно использовать по
                своему усмотрению. Vsivuha не несет ответственности за любую информацию, размещенную пользователями
                Сайта.</p>

            <h2>Использование персональных данных</h2>
            <p>Мы используем различные технологии для сбора и хранения информации, когда вы посещаете сайт Vsivuha
                (подробнее о защите и обработке персональных данных ). Это может включать в себя запись одного или
                нескольких куки или анонимных идентификаторов. Мы также используем куки и анонимные идентификаторы,
                когда вы взаимодействуете с услугами, предложенными нашими партнерами, такими как рекламные услуги,
                например, которые могут появиться на других сайтах.</p>

            <p>Мы можем передавать информацию указанную пользователями сайта третьим лицам для осуществления доставки
                товара пользователям.</p>

            <h2>Сообщения и рассылки</h2>
            <p>Vsivuha может направлять вам сообщение в ответ на сообщения (запросы и жалобы), направленные вами через
                форму обратной связи и в процессе заказа товаров и/или услуг, при управлении заказами, востановлении
                пароля, выдачи товаров, оказании услуг. Vsivuha осуществляет передачу сообщений в виде email-писем,
                сообщений в Viber, SMS-сообщений, уведомлений в мобильном приложении, уведомлений в веб-браузере.</p>
        </div>
    )
}