import React from "react";
import s from "./promotions.module.css"
import ss from "../info.module.css"
import {useRouter} from "next/router";

export const Promotions = ()=>{

  const locale = useRouter().locale;

  if(locale === "ru"){
    return(
      <div className={ss.infoMain+' '+s.promotionMain}>
        <div>
          <p>1) Оставьте отзыв на странице купленного товар, и получите дополнительную скидку в 5% на любой заказ.</p>
          <p>2) Заказ на сумму свыше 2000 грн доставляется бесплатно.</p>
          <p>3) На третий по счету заказ в один месяц - скидка 10%</p>

          {/*<p>Кожен день забирать бали шоб привикнуть до сайту і тратить їх на закази</p>*/}
          {/*тартить бали на подарки, лутбоксы, аукцион...*/}
        </div>
      </div>
    )
  } else{
    return(
      <div className={ss.infoMain+' '+s.promotionMain}>
        <div>
          <p>1) Залиште відгук на сторінці купленого товару, і отримаєте додаткову знижку в 5% на будь-яке замовлення.</p>
          <p>2) Замовлення на суму понад 2000 грн доставляється безкоштовно.</p>
          <p>3) На трете за рахунком замовлення в той самий місяць - знижка 10%</p>

          {/*<p>Кожен день забирать бали шоб привикнуть до сайту і тратить їх на закази</p>*/}
          {/*тартить бали на подарки, лутбоксы, аукцион...*/}
        </div>
      </div>
    )
  }
}